include/Discovery_Authenticated.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope
    xmlns:env="http://www.w3.org/2003/05/soap-envelope"
    xmlns:adr="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:sec="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext1.0.xsd"
    xmlns:usec="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility1.0.xsd"
    xmlns:dsc="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:target="http://www.onvif.org/ver10/network/wsdl">
    <env:Header>
        <sec:Security>
            <sec:UsernameToken>
                <sec:Username>$USERNAME$</sec:Username>
                <sec:Password
                    Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wssusername-token-profile1.0#PasswordDigest">
                    $PASSHASH$
                </sec:Password>
                <sec:Nonce>$NONCE$</sec:Nonce>
                <usec:Created>$NOW$</usec:Created>
            </sec:UsernameToken>
        </sec:Security>
        <adr:MessageID>uuid:$UUID$</adr:MessageID>
        <adr:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</adr:To>
        <adr:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Probe</adr:Action>
    </env:Header>
    <env:Body>
        <dsc:Probe>
            <dsc:Types>target:NetworkVideoTransmitter</dsc:Types>
        </dsc:Probe>
    </env:Body>
</env:Envelope>
